turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2C.atdf
        <register name="LCV" offset="0x2C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Sequencer Last Converted Value Register">
          <bitfield name="LCV" caption="Last converted value" mask="0xFFFF"/>
          <bitfield name="LCPC" caption="Last converted positive channel" mask="0xF0000"/>
          <bitfield name="LCNC" caption="Last converted negative channel" mask="0x700000"/>
        </register>
        <register name="IER" offset="0x30" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="SEOC" caption="Sequencer end of conversion Interrupt Enable" mask="0x1"/>
          <bitfield name="LOVR" caption="Sequencer last converted value overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="WM" caption="Window monitor Interrupt Enable" mask="0x4"/>
          <bitfield name="SMTRG" caption="Sequencer missed trigger event Interrupt Enable" mask="0x8"/>
          <bitfield name="TTO" caption="Timer time-out Interrupt Enable" mask="0x20"/>
        </register>
        <register name="IDR" offset="0x34" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="SEOC" caption="Sequencer end of conversion Interrupt Disable" mask="0x1"/>
          <bitfield name="LOVR" caption="Sequencer last converted value overrun Interrupt Disable" mask="0x2"/>
          <bitfield name="WM" caption="Window monitor Interrupt Disable" mask="0x4"/>
          <bitfield name="SMTRG" caption="Sequencer missed trigger event Interrupt Disable" mask="0x8"/>
          <bitfield name="TTO" caption="Timer time-out Interrupt Disable" mask="0x20"/>
        </register>
        <register name="IMR" offset="0x38" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="SEOC" caption="Sequencer end of conversion Interrupt Mask" mask="0x1"/>
          <bitfield name="LOVR" caption="Sequencer last converted value overrun Interrupt Mask" mask="0x2"/>
          <bitfield name="WM" caption="Window monitor Interrupt Mask" mask="0x4"/>
          <bitfield name="SMTRG" caption="Sequencer missed trigger event Interrupt Mask" mask="0x8"/>
          <bitfield name="TTO" caption="Timer time-out Interrupt Mask" mask="0x20"/>
        </register>
        <register name="CALIB" offset="0x3C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Calibration Register">
          <bitfield name="CALIB" caption="Calibration Value" mask="0xFF"/>
          <bitfield name="BIASSEL" caption="Select bias mode" mask="0x100"/>
          <bitfield name="BIASCAL" caption="Bias Calibration" mask="0xF000"/>
          <bitfield name="FCD" caption="Flash Calibration Done" mask="0x10000"/>
        </register>
        <register name="VERSION" offset="0x40" rw="R" size="4" access-size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="PARAMETER" offset="0x44" rw="R" size="4" access-size="4" caption="Parameter Register">
          <bitfield name="N" caption="Number of channels" mask="0xFF"/>
        </register>
      </register-group>
    </module>
    <module name="AESA" id="I7558" version="1.0.2" caption="Advanced Encryption Standard">
      <register-group name="AESA" caption="Advanced Encryption Standard">
        <register name="CTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="ENABLE" caption="Enable Module" mask="0x1"/>
          <bitfield name="DKEYGEN" caption="Decryption Key Generate" mask="0x2"/>
          <bitfield name="NEWMSG" caption="New Message" mask="0x4"/>
          <bitfield name="SWRST" caption="Software Reset" mask="0x100"/>
        </register>
        <register name="MODE" offset="0x4" rw="RW" size="4" initval="0x000F0000" caption="Mode Register">
          <bitfield name="ENCRYPT" caption="Encryption" mask="0x1"/>
          <bitfield name="KEYSIZE" caption="Key Size" mask="0x6"/>
          <bitfield name="DMA" caption="DMA Mode" mask="0x8"/>
          <bitfield name="OPMODE" caption="Confidentiality Mode of Operation" mask="0x70"/>
          <bitfield name="CFBS" caption="Cipher Feedback Data Segment Size" mask="0x700"/>
          <bitfield name="CTYPE" caption="Countermeasure Type" mask="0xF0000"/>
        </register>
        <register name="DATABUFPTR" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Data Buffer Pointer Register">
          <bitfield name="IDATAW" caption="Input Data Word" mask="0x3"/>
          <bitfield name="ODATAW" caption="Output Data Word" mask="0x30"/>
        </register>
        <register name="SR" offset="0xC" rw="R" size="4" initval="0x00010000" caption="Status Register">
          <bitfield name="ODATARDY" caption="Output Data Ready" mask="0x1"/>
          <bitfield name="IBUFRDY" caption="Input Buffer Ready" mask="0x10000"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="ODATARDY" caption="Output Data Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="IBUFRDY" caption="Input Buffer Ready Interrupt Enable" mask="0x10000"/>
        </register>
        <register name="IDR" offset="0x14" rw="W" size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="ODATARDY" caption="Output Data Ready Interrupt Disable" mask="0x1"/>
          <bitfield name="IBUFRDY" caption="Input Buffer Ready Interrupt Disable" mask="0x10000"/>
        </register>
        <register name="IMR" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="ODATARDY" caption="Output Data Ready Interrupt Mask" mask="0x1"/>
          <bitfield name="IBUFRDY" caption="Input Buffer Ready Interrupt Mask" mask="0x10000"/>
        </register>
