turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2C.atdf
        <register name="IDR" offset="0xC" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Disable" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Disable" mask="0x8"/>
        </register>
        <register name="IMR" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Mask" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Mask" mask="0x8"/>
        </register>
        <register name="SR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="EN" caption="Enable Status" mask="0x1"/>
          <bitfield name="CS" caption="Capture Status" mask="0x2"/>
          <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Status" mask="0x8"/>
        </register>
        <register name="ICR" offset="0x18" rw="W" size="4" access-size="4" atomic-op="clear:SR" initval="0x00000000" caption="Interrupt Status Clear Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Status Clear" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Status Clear" mask="0x8"/>
        </register>
        <register name="RHR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="CDATA" caption="Captured Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="PDCA" id="I7514" version="1.2.4" caption="Peripheral DMA Controller">
      <register-group name="channel" size="0x40">
        <register name="MAR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Memory Address Register">
          <bitfield name="MADDR" caption="Memory Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="PSR" offset="0x4" rw="RW" size="4" access-size="4" caption="Peripheral Select Register">
          <bitfield name="PID" caption="Peripheral Identifier" mask="0xFF"/>
        </register>
        <register name="TCR" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Transfer Counter Register">
          <bitfield name="TCV" caption="Transfer Counter Value" mask="0xFFFF"/>
        </register>
        <register name="MARR" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Memory Address Reload Register">
          <bitfield name="MARV" caption="Memory Address Reload Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="TCRR" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Transfer Counter Reload Register">
          <bitfield name="TCRV" caption="Transfer Counter Reload Value" mask="0xFFFF"/>
        </register>
        <register name="CR" offset="0x14" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="TEN" caption="Transfer Enable" mask="0x1"/>
          <bitfield name="TDIS" caption="Transfer Disable" mask="0x2"/>
          <bitfield name="ECLR" caption="Error Clear" mask="0x100"/>
        </register>
        <register name="MR" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="SIZE" caption="Transfer size" mask="0x3" values="PDCA_MR__SIZE"/>
          <bitfield name="ETRIG" caption="Event trigger" mask="0x4"/>
          <bitfield name="RING" caption="Ring Buffer" mask="0x8"/>
        </register>
        <register name="SR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="TEN" caption="Transfer Enabled" mask="0x1"/>
        </register>
        <register name="IER" offset="0x20" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="RCZ" caption="Reload Counter Zero" mask="0x1"/>
          <bitfield name="TRC" caption="Transfer Complete" mask="0x2"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x4"/>
        </register>
        <register name="IDR" offset="0x24" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="RCZ" caption="Reload Counter Zero" mask="0x1"/>
          <bitfield name="TRC" caption="Transfer Complete" mask="0x2"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x4"/>
        </register>
        <register name="IMR" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RCZ" caption="Reload Counter Zero" mask="0x1"/>
          <bitfield name="TRC" caption="Transfer Complete" mask="0x2"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x4"/>
        </register>
        <register name="ISR" offset="0x2C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="RCZ" caption="Reload Counter Zero" mask="0x1"/>
          <bitfield name="TRC" caption="Transfer Complete" mask="0x2"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x4"/>
        </register>
      </register-group>
      <register-group name="PDCA" caption="Peripheral DMA Controller">
        <register-group name="channel" name-in-module="channel" offset="0x000" count="16"/>
        <register name="PCONTROL" offset="0x800" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Performance Control Register">
          <bitfield name="CH0EN" caption="Channel 0 Enabled" mask="0x1"/>
          <bitfield name="CH1EN" caption="Channel 1 Enabled." mask="0x2"/>
          <bitfield name="CH0OF" caption="Channel 0 Overflow Freeze" mask="0x10"/>
          <bitfield name="CH1OF" caption="Channel 1 overflow freeze" mask="0x20"/>
          <bitfield name="CH0RES" caption="Channel 0 counter reset" mask="0x100"/>
          <bitfield name="CH1RES" caption="Channel 1 counter reset" mask="0x200"/>
          <bitfield name="MON0CH" caption="PDCA Channel to monitor with counter 0" mask="0x3F0000"/>
          <bitfield name="MON1CH" caption="PDCA Channel to monitor with counter 1" mask="0x3F000000"/>
        </register>
        <register name="PRDATA0" offset="0x804" rw="R" size="4" access-size="4" initval="0x00000000" caption="Channel 0 Read Data Cycles">
          <bitfield name="DATA" caption="Data Cycles Counted Since Last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PRSTALL0" offset="0x808" rw="R" size="4" access-size="4" initval="0x00000000" caption="Channel 0 Read Stall Cycles">
          <bitfield name="STALL" caption="Stall Cycles counted since last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PRLAT0" offset="0x80C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Channel 0 Read Max Latency">
          <bitfield name="LAT" caption="Maximum Transfer Initiation cycles counted since last reset" mask="0xFFFF"/>
        </register>
        <register name="PWDATA0" offset="0x810" rw="R" size="4" access-size="4" initval="0x00000000" caption="Channel 0 Write Data Cycles">
          <bitfield name="DATA" caption="Data Cycles Counted since last Reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PWSTALL0" offset="0x814" rw="R" size="4" access-size="4" initval="0x00000000" caption="Channel 0 Write Stall Cycles">
          <bitfield name="STALL" caption="Stall cycles counted since last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PWLAT0" offset="0x818" rw="R" size="4" access-size="4" initval="0x00000000" caption="Channel0 Write Max Latency">
          <bitfield name="LAT" caption="Maximum transfer initiation cycles counted since last reset" mask="0xFFFF"/>
        </register>
        <register name="PRDATA1" offset="0x81C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Channel 1 Read Data Cycles">
          <bitfield name="DATA" caption="Data Cycles Counted Since Last reset" mask="0xFFFFFFFF"/>
        </register>
