turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2C.atdf
      <value-group name="PEVC_CHER__CHE">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_CHDR__CHD">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Disable Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_SEV__SEV">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="CPU forces software event to channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_BUSY__BUSY">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Channel j or User j is Busy" value="1"/>
      </value-group>
      <value-group name="PEVC_TRIER__TRIE">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Trigger j Interrupt" value="1"/>
      </value-group>
      <value-group name="PEVC_TRIDR__TRID">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Disable Trigger j Interrupt" value="1"/>
      </value-group>
      <value-group name="PEVC_TRIMR__TRIM">
        <value name="0" caption="Trigger j Interrupt Disabled" value="0"/>
        <value name="1" caption="Trigger j Interrupt Enabled" value="1"/>
      </value-group>
      <value-group name="PEVC_TRSR__TRS">
        <value name="0" caption="Channel j did not send out an Event in the past" value="0"/>
        <value name="1" caption="Channel j did send out an Event in the past" value="1"/>
      </value-group>
      <value-group name="PEVC_TRSCR__TRSC">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Clear TRSR[j]" value="1"/>
      </value-group>
      <value-group name="PEVC_OVIER__OVIE">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Overrun Interrupt for Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_OVIDR__OVID">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Overrun Interrupt for Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_OVIMR__OVIM">
        <value name="0" caption="Overrun Interrupt for Channel j Disabled" value="0"/>
        <value name="1" caption="Overrun Interrupt for Channel j Enabled" value="1"/>
      </value-group>
      <value-group name="PEVC_OVSR__OVS">
        <value name="0" caption="No Overrun occured on Channel j" value="0"/>
        <value name="1" caption="Overrun occured on Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_OVSCR__OVSC">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Clear Overrun Status Bit j" value="1"/>
      </value-group>
      <value-group name="PEVC_CHMX__EVMX">
        <value name="0x00" caption="Event 0" value="0x00"/>
        <value name="0x01" caption="Event 1" value="0x01"/>
      </value-group>
      <value-group name="PEVC_CHMX__SMX">
        <value name="0" caption="Hardware events" value="0"/>
        <value name="1" caption="Software event" value="1"/>
      </value-group>
      <value-group name="PEVC_EVS__EN">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Event Shaper enable" value="1"/>
      </value-group>
      <value-group name="PEVC_EVS__IGFF">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Input Glitch Filter : a falling edge on event input will raise trigger output" value="1"/>
      </value-group>
      <value-group name="PEVC_EVS__IGFR">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Input Glitch Filter : a rising edge on event input will raise trigger output" value="1"/>
      </value-group>
    </module>
    <module name="PICOUART" id="I8403" version="1.0.1" caption="Pico UART">
      <register-group name="PICOUART" caption="Pico UART">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="DIS" caption="Disable" mask="0x2"/>
        </register>
        <register name="CFG" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Configuration Register">
          <bitfield name="SOURCE" caption="Source Enable Mode" mask="0x3"/>
          <bitfield name="ACTION" caption="Action to perform" mask="0x4"/>
          <bitfield name="MATCH" caption="Data Match" mask="0xFF00"/>
        </register>
        <register name="SR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="EN" caption="Enable Interrupt Status" mask="0x1"/>
          <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x2"/>
        </register>
        <register name="RHR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="CDATA" caption="Received Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000101" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="PM" id="I7146" version="4.4.1" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="MCCTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Main Clock Control">
          <bitfield name="MCSEL" caption="Main Clock Select" mask="0x7"/>
        </register>
        <register name="CPUSEL" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="CPU Clock Select">
          <bitfield name="CPUSEL" caption="CPU Clock Select" mask="0x7" values="PM_CPUSEL__CPUSEL"/>
          <bitfield name="CPUDIV" caption="CPU Division" mask="0x80"/>
        </register>
        <register name="PBASEL" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="PBA Clock Select">
          <bitfield name="PBSEL" caption="PBA Clock Select" mask="0x7"/>
          <bitfield name="PBDIV" caption="PBA Division Select" mask="0x80"/>
        </register>
        <register name="PBBSEL" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="PBB Clock Select">
          <bitfield name="PBSEL" caption="PBB Clock Select" mask="0x7"/>
          <bitfield name="PBDIV" caption="PBB Division Select" mask="0x80"/>
        </register>
        <register name="PBCSEL" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="PBC Clock Select">
          <bitfield name="PBSEL" caption="PBC Clock Select" mask="0x7"/>
          <bitfield name="PBDIV" caption="PBC Division Select" mask="0x80"/>
        </register>
        <register name="PBDSEL" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="PBD Clock Select">
          <bitfield name="PBSEL" caption="PBD Clock Select" mask="0x7"/>
          <bitfield name="PBDIV" caption="PBD Division Select" mask="0x80"/>
        </register>
