turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2C.atdf
      <value-group name="USBC_UECFG1__EPBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG1__EPDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG1__EPSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UECFG1__EPTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UECFG2__EPBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG2__EPDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG2__EPSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UECFG2__EPTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UECFG3__EPBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG3__EPDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG3__EPSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UECFG3__EPTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UECFG4__EPBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG4__EPDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG4__EPSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UECFG4__EPTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UECFG5__EPBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG5__EPDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG5__EPSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UECFG5__EPTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UECFG6__EPBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG6__EPDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG6__EPSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UECFG6__EPTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UECFG7__EPBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG7__EPDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG7__EPSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UECFG7__EPTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
