turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2C.atdf
                <register offset="0x00000360" size="1" name="NVICIP96" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI96" caption="Priority of interrupt 96"/>
                </register>
                <register offset="0x00000361" size="1" name="NVICIP97" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI97" caption="Priority of interrupt 97"/>
                </register>
                <register offset="0x00000362" size="1" name="NVICIP98" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI98" caption="Priority of interrupt 98"/>
                </register>
                <register offset="0x00000363" size="1" name="NVICIP99" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI99" caption="Priority of interrupt 99"/>
                </register>
                <register offset="0x00000364" size="1" name="NVICIP100" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI100" caption="Priority of interrupt 100"/>
                </register>
                <register offset="0x00000365" size="1" name="NVICIP101" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI101" caption="Priority of interrupt 101"/>
                </register>
                <register offset="0x00000366" size="1" name="NVICIP102" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI102" caption="Priority of interrupt 102"/>
                </register>
                <register offset="0x00000367" size="1" name="NVICIP103" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI103" caption="Priority of interrupt 103"/>
                </register>
                <register offset="0x00000368" size="1" name="NVICIP104" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI104" caption="Priority of interrupt 104"/>
                </register>
                <register offset="0x00000369" size="1" name="NVICIP105" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI105" caption="Priority of interrupt 105"/>
                </register>
                <register offset="0x00000e00" size="4" name="NVICSTIR" initval="0" caption="Software Trigger Interrupt Register">
                    <bitfield mask="0x000001ff" name="INTID" caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
                </register>
            </register-group>
        </module><module name="MPU" caption="Memory Protection Unit Registers">
            <register-group name="MPU" caption="Memory Protection Unit">
                <register offset="0x00000000" size="4" name="MPU_TYPE" initval="0x00000800" caption="MPU Type Register" rw="R">
                    <bitfield mask="0x00000001" name="SEPARATE" caption="Indicates support for unified or separate instruction and date memory maps."/>
                    <bitfield mask="0x0000FF00" name="DREGION" caption="Indicates the number of supported MPU instruction regions."/>
                    <bitfield mask="0x00FF0000" name="IREGION" caption="Indicates the number of supported MPU data regions."/>
                </register>
                <register offset="0x00000004" size="4" name="MPU_CTRL" initval="0x00000000" caption="MPU Control Register" rw="RW">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
                    <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
                    <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
                </register>
                <register offset="0x00000008" size="4" name="MPU_RNR" initval="0x00000000" caption="MPU Region Number Register" rw="RW">
                    <bitfield mask="0x000000FF" name="REGION" caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
                </register>
                <register offset="0x0000000C" size="4" name="MPU_RBAR" initval="0x00000000" caption="MPU Region Base Address Register" rw="RW">
                    <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
                    <bitfield mask="0x00000010" name="VALID" caption="MPU Region Number valid bit."/>
                    <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
                </register>
                <register offset="0x00000010" size="4" name="MPU_RASR" initval="0x00000000" caption="MPU Region Attribute and Size Register" rw="RW">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
                    <bitfield mask="0x0000003E" name="SIZE" caption="Specifies the size of the MPU protection region."/>
                    <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
                    <bitfield mask="0x00010000" name="B" caption="MPU access permission attributes."/>
                    <bitfield mask="0x00020000" name="C" caption="MPU access permission attributes."/>
                    <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
                    <bitfield mask="0x00380000" name="TEX" caption="MPU access permission attributes."/>
                    <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
                    <bitfield mask="0x10000000" name="XN" caption="Instruction access disable bit."/>
                </register>
            </register-group>
        </module></modules>
  <pinouts>
    <pinout name="QFP100" caption="QFP100">
      <pin position="1" pad="PC00"/>
      <pin position="2" pad="PC01"/>
      <pin position="3" pad="PC02"/>
      <pin position="4" pad="PC03"/>
      <pin position="5" pad="PA00"/>
      <pin position="6" pad="PA01"/>
      <pin position="7" pad="GNDIO05"/>
      <pin position="8" pad="VDDIO05"/>
      <pin position="9" pad="PC"/>
      <pin position="10" pad="PC"/>
      <pin position="11" pad="PC"/>
      <pin position="12" pad="PA"/>
      <pin position="13" pad="RESET_N"/>
      <pin position="14" pad="VDDCORE"/>
      <pin position="15" pad="GNDIN"/>
      <pin position="16" pad="VDDOUT"/>
      <pin position="17" pad="VDDIN"/>
      <pin position="18" pad="TCK"/>
      <pin position="19" pad="PA"/>
      <pin position="20" pad="PB"/>
      <pin position="21" pad="PB"/>
      <pin position="22" pad="PB02"/>
      <pin position="23" pad="PB03"/>
      <pin position="24" pad="PA04"/>
      <pin position="25" pad="PA05"/>
      <pin position="26" pad="XIN32"/>
      <pin position="27" pad="XOUT32"/>
      <pin position="28" pad="PB04"/>
      <pin position="29" pad="PB05"/>
      <pin position="30" pad="PA"/>
      <pin position="31" pad="PA07"/>
      <pin position="32" pad="ADVREFN"/>
      <pin position="33" pad="GNDANA"/>
      <pin position="34" pad="ADVREFP"/>
      <pin position="35" pad="VANA"/>
      <pin position="36" pad="PC07"/>
      <pin position="37" pad="PC08"/>
      <pin position="38" pad="PC09"/>
      <pin position="39" pad="PC10"/>
      <pin position="40" pad="PC11"/>
      <pin position="41" pad="PC12"/>
      <pin position="42" pad="PC13"/>
      <pin position="43" pad="PC14"/>
      <pin position="44" pad="PA08"/>
      <pin position="45" pad="PB06"/>
      <pin position="46" pad="PB07"/>
      <pin position="47" pad="PA09"/>
      <pin position="48" pad="PA10"/>
      <pin position="49" pad="PA11"/>
      <pin position="50" pad="PA12"/>
      <pin position="51" pad="CAPH"/>
      <pin position="52" pad="CAPL"/>
      <pin position="53" pad="VLCD"/>
      <pin position="54" pad="BIAS1"/>
      <pin position="55" pad="BIAS2"/>
      <pin position="56" pad="GNDIO00"/>
      <pin position="57" pad="VPUMP"/>
      <pin position="58" pad="PC15"/>
      <pin position="59" pad="PC16"/>
      <pin position="60" pad="PC17"/>
      <pin position="61" pad="PC18"/>
      <pin position="62" pad="PC19"/>
      <pin position="63" pad="PA"/>
      <pin position="64" pad="PA14"/>
      <pin position="65" pad="PA15"/>
      <pin position="66" pad="PA16"/>
      <pin position="67" pad="PA17"/>
      <pin position="68" pad="PC20"/>
      <pin position="69" pad="PC21"/>
      <pin position="70" pad="PC22"/>
      <pin position="71" pad="PC23"/>
      <pin position="72" pad="PB08"/>
      <pin position="73" pad="PB09"/>
      <pin position="74" pad="PB10"/>
      <pin position="75" pad="PB11"/>
      <pin position="76" pad="PA18"/>
      <pin position="77" pad="PA19"/>
      <pin position="78" pad="PA20"/>
      <pin position="79" pad="PC24"/>
      <pin position="80" pad="PC25"/>
      <pin position="81" pad="PC26"/>
      <pin position="82" pad="PC27"/>
      <pin position="83" pad="PC28"/>
      <pin position="84" pad="PC29"/>
      <pin position="85" pad="PC30"/>
      <pin position="86" pad="PC31"/>
      <pin position="87" pad="VDDIO02"/>
      <pin position="88" pad="VDDIO03"/>
      <pin position="89" pad="PB12"/>
      <pin position="90" pad="PB13"/>
      <pin position="91" pad="PA"/>
      <pin position="92" pad="PA"/>
      <pin position="93" pad="PB"/>
      <pin position="94" pad="PB"/>
      <pin position="95" pad="PA"/>
      <pin position="96" pad="PA"/>
      <pin position="97" pad="VDDIO04"/>
      <pin position="98" pad="PA25"/>
      <pin position="99" pad="PA26"/>
      <pin position="100" pad="GNDIO04"/>
    </pinout>
    <pinout name="VFBGA100" caption="VFBGA100">
      <pin position="A1" pad="PA05"/>
      <pin position="A2" pad="PA04"/>
      <pin position="A3" pad="GNDIN"/>
      <pin position="A4" pad="VDDIN"/>
      <pin position="A5" pad="VDDOUT"/>
      <pin position="A6" pad="VDDCORE"/>
      <pin position="A7" pad="PA"/>
      <pin position="A8" pad="VDDIO05"/>
      <pin position="A9" pad="GNDIO05"/>
      <pin position="A10" pad="PC00"/>
      <pin position="B1" pad="PB05"/>
      <pin position="B2" pad="XIN32"/>
      <pin position="B3" pad="PA"/>
      <pin position="B4" pad="TCK"/>
      <pin position="B5" pad="RESET_N"/>
      <pin position="B6" pad="PC"/>
      <pin position="B7" pad="PC03"/>
      <pin position="B8" pad="PA01"/>
      <pin position="B9" pad="PA00"/>
      <pin position="B10" pad="GNDIO04"/>
      <pin position="C1" pad="PB04"/>
      <pin position="C2" pad="XOUT32"/>
      <pin position="C3" pad="PA"/>
      <pin position="C4" pad="PB03"/>
      <pin position="C5" pad="PC"/>
      <pin position="C6" pad="PC"/>
      <pin position="C7" pad="PC02"/>
      <pin position="C8" pad="PC01"/>
      <pin position="C9" pad="PA26"/>
      <pin position="C10" pad="VDDIO04"/>
      <pin position="D1" pad="ADVREFN"/>
      <pin position="D2" pad="GNDANA"/>
      <pin position="D3" pad="PA07"/>
      <pin position="D4" pad="PC10"/>
      <pin position="D5" pad="PB"/>
      <pin position="D6" pad="PA"/>
      <pin position="D7" pad="PB"/>
      <pin position="D8" pad="PB"/>
      <pin position="D9" pad="PA25"/>
      <pin position="D10" pad="PA"/>
      <pin position="E1" pad="VANA"/>
      <pin position="E2" pad="ADVREFP"/>
      <pin position="E3" pad="PC08"/>
      <pin position="E4" pad="PC11"/>
      <pin position="E5" pad="PB02"/>
      <pin position="E6" pad="VDDIO02"/>
      <pin position="E7" pad="PB12"/>
      <pin position="E8" pad="PB13"/>
      <pin position="E9" pad="PA"/>
      <pin position="E10" pad="PA"/>
      <pin position="F1" pad="PC09"/>
      <pin position="F2" pad="PC07"/>
      <pin position="F3" pad="PC12"/>
      <pin position="F4" pad="PC13"/>
      <pin position="F5" pad="PA09"/>
      <pin position="F6" pad="PC27"/>
      <pin position="F7" pad="PC29"/>
      <pin position="F8" pad="PC30"/>
      <pin position="F9" pad="PC31"/>
      <pin position="F10" pad="VDDIO03"/>
      <pin position="G1" pad="PC14"/>
      <pin position="G2" pad="PA08"/>
      <pin position="G3" pad="PB06"/>
      <pin position="G4" pad="PC19"/>
      <pin position="G5" pad="PA15"/>
      <pin position="G6" pad="PB08"/>
      <pin position="G7" pad="PB09"/>
      <pin position="G8" pad="PB10"/>
      <pin position="G9" pad="PC26"/>
      <pin position="G10" pad="PC28"/>
      <pin position="H1" pad="PB07"/>
      <pin position="H2" pad="PA10"/>
      <pin position="H3" pad="PA11"/>
      <pin position="H4" pad="PC17"/>
      <pin position="H5" pad="PA"/>
      <pin position="H6" pad="PA17"/>
      <pin position="H7" pad="PC20"/>
      <pin position="H8" pad="PC23"/>
      <pin position="H9" pad="PC25"/>
      <pin position="H10" pad="PA20"/>
      <pin position="J1" pad="CAPL"/>
      <pin position="J2" pad="PA12"/>
      <pin position="J3" pad="PB"/>
      <pin position="J4" pad="BIAS2"/>
      <pin position="J5" pad="PC15"/>
      <pin position="J6" pad="PC16"/>
      <pin position="J7" pad="PA16"/>
      <pin position="J8" pad="PC22"/>
      <pin position="J9" pad="PC24"/>
      <pin position="J10" pad="PA19"/>
      <pin position="K1" pad="CAPH"/>
      <pin position="K2" pad="VLCD"/>
      <pin position="K3" pad="BIAS1"/>
      <pin position="K4" pad="GNDIO00"/>
      <pin position="K5" pad="VPUMP"/>
      <pin position="K6" pad="PC18"/>
      <pin position="K7" pad="PA14"/>
      <pin position="K8" pad="PC21"/>
      <pin position="K9" pad="PB11"/>
      <pin position="K10" pad="PA18"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>